{
  "basics": {
    "name": "David King",
    "label": "Student",
    "picture": "https://avatars.githubusercontent.com/u/229238409?v=4",
    "email": "dking3@hawaii.edu",
    "phone": "903-830-5847",
    "website": "https://david-r-king.github.io",
    "summary": "In pursuit of my B.A. in Computer Science in the Department of Information and Computer Sciences at the University of Hawai'i. Expected graduation date: Spring, 2027. Strong interest in federal information security and network engineering career path.",
    "location": { "address": "", "postalCode": "96744", "city": "Kanoehe", "countryCode": "USA", "region": "Hawai'i" },
    "profiles": [
      { "network": "github", "username": "david-r-king", "url": "http://github.com/david-r-king" },
      { "network": "linkedin", "username": "davidrking31", "url": "https://www.linkedin.com/in/davidrking31/" }
    ]
  },
  "interests": [
    { "name": "Network Engineering" },
    { "name": "Information Security" },
    { "name": "Cloud-Based Technologies" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "Java", "Python", "C", "C++" ]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "MacOS", "Ubuntu", "Git/GitHub", "Windows" ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawai'i, Honolulu, HI",
      "area": "Computer Science (Expected Spring, 2027)",
      "studyType": "B.A.",
      "startDate": "2024-08-15",
      "endDate": "Present",
      "courses": [ "Data Structure", "Linear Algebra", "Calculus I & II", "Algorithms", "Software Engineering I & II"
      ]
    },
    {
      "institution": "Embry-Riddle Aeronautical University",
      "area": "Microsoft Software & Systems Academy",
      "studyType": "Certification",
      "startDate": "2021-01-14",
      "endDate": "2021-05-01",
      "courses": [ "Server & Cloud Administration", "DNS & Network Services", "Enterprise Network Architecture & Design", "Active Directly Services & Identity Management", "Remote Access & Security Services", "Cloud Platforms & Virtualization (Azure)"
      ]
    }  
  ],
  "work": [
    {
      "company": "Smart City Networks",
      "position": "Lead Network Technician",
      "website": "https://smartcitynetworks.com/",
      "startDate": "2023-07-15",
      "endDate": "Present",
      "summary": "Providing networking services for large-scale, live events at the Hawai'i Convention Center.",
      "highlights": [
        "Deliver reliable wired and wireless connectivity for high-profile events at the Hawai’i Convention Center, enabling seamless operations for event coordinators and clients.",
        "Configure Cisco switches and managed VLAN segmentation to optimize traffic flow and meet specific client performance and security requirements.",
        "Deploy infrastructure upgrades and redesign IDFs as needed, enhancing network reliability and streamlining future event setups.",
        "Leverage Cisco WLC to provision supplemental wireless access points with tailored bandwidth allocations based on projected attendance, user roles, and venue layout."
      ]
    },
    {
      "company": "Affordable Painting and Repair",
      "position": "Project Manager",
      "website": "https://affordableremodelingetx.com/",
      "startDate": "2021-9-10",
      "endDate": "2023-07-02",
      "summary": "Managed home remodeling projects in East Texas.",
      "highlights": [
        "Coordinated with team members daily to discuss the scope of work and evaluate any challenges we might encounter, establishing a smooth and efficient work flow.",
        "Met with customers periodically to cover all facets of the work being performed and clarify all specifications, ensuring a high percentage of customer satisfaction.",
        "Scheduled sub-contractors for different phases of a job and communicate with all parties involved, maximizing our productivity and time management.",
        "Updated invoices based on changes to the scope of work, material upgrades and any unforeseen damage to current area of work, providing an up to date customer balance and avoiding any confusion in the process.",
        "Recorded all company transactions throughout the year with an organized and simple to understand methodology, providing the maximum financial benefits for end of year taxes and granting a price reference for invoicing purposes."
      ]
    },
    {
      "company": "General Dynamics Information Technology",
      "position": "End-to-End Systems Engineer",
      "website": "https://www.gdit.com/",
      "startDate": "2021-05-01",
      "endDate": "2021-9-01",
      "summary": "Planned and executed training evolutions for the 25th Infantry Division.",
      "highlights": [
        "Analyzed physical and logical network topologies with team members for planning, designing, evaluating, selecting and upgrading operating systems and protocol suites to ensure an efficient and safe training evolution for military clients from the battalion to divisional level.",
        "Coordinated closely with high-ranking military officials to deliver appropriate and effective training for Army units to properly conduct missions overseas.",
        "Assisted in the planning and implementation of highly available networks at the needs of the customer which included SIPR, NIPR and FVEY networks.",
        "Collaborated with a variety of government entities to ensure the continuous connectivity and safety of secure networks, allowing for a smooth and consistent training routine for the customer.",
        "Logged possible security vulnerabilities and network deficiencies during live simulations to pass along information and improve every stage of future evolutions."
      ]
    },
    {
      "company": "United States Navy",
      "position": "Senior Security Boat Captain",
      "website": "https://www.navy.com/",
      "startDate": "2014-03-017",
      "endDate": "2021-5-17",
      "summary": "Provided static and dynamic waterborne security for high-value assets in transit.",
      "highlights": [
        "Coordinated closely within a team to provide secure passage for designated customers through the Pearl Harbor channel. ",
        "Conducted over 250 hours of technical boat training for new personnel which provided continuous protection throughout the harbor for all residents.",
        "Administered over 100 escorts for customers transiting in the harbor, requiring an immense amount of focus and attention to detail every day, with zero mishaps.",
        "Made direct and deliberate decisions in an instant to ensure a safe environment for all personnel within the harbor.",
        "Analyzed standard operating procedures and conducted simulated scenarios with my team, leading to an always prepared and ready waterborne security force."
       ]
    }
  ],
  "volunteer": [
    {
      "organization": "The Pantry",
      "website": "https://thepantry.org/",
      "position": "Packing & Food Distribution",
      "startDate": "2023-11-01",
      "endDate": "Present",
      "summary": "Pack food to hand out to people in need during the holiday season",
      "highlights": [
        "Coordinate food requests and ensure proper, timely delivery"
      ]
    }
  ],
  "awards and certifications": [
    {
      "title": "Security+",
      "date": "2021",
      "awarder": "CompTIA",
      "summary": "Entry-level certification that validates core cybersecurity skills, including securing networks, managing risk, and incident response."
    },
    {
      "title": "MTA 98-366",
      "date": "2021",
      "awarder": "Microsoft",
      "summary": "Networking fundamentals certiication validating core knowledge in network infrastructure, hardware, protocols and services for entry-level technical positions."
    },
    {
      "title": "AZ-900",
      "date": "2021",
      "awarder": "Microsoft",
      "summary": "Demonstrates foundational knowledge of cloud concepts, core Azure services, Azure management and governance features and tools."
    },
    {
      "title": "Navy and Marine Corps Achievement Medal",
      "date": "2018",
      "awarder": "Department of Defense",
      "summary": "Award for exceptional performance while serving overseas, providing static security for civilian vessels in austere environments, and leading a small security team in the Mediterranean Sea."
    }
  ],
  "references": [
    {
      "name": "David Bachler"
      "relationship": "Previous Manager - Smart City Networks"
      "contact": "808-271-1832"
    },
    {
      "name": "Christian Peterson"
      "relationship": "Current Manager - Smart City Networks"
      "contact": "918-955-1019"
    },
    {
      "name": "Jim Snook"
      "relationship": "Regional Manager - Smart City Networks"
      "contact": "808-321-4664"
    }
  ]
}
